Public Attributes | List of all members
API_CWJunctionType Struct Reference
Element Manager API
Represents a curtain wall junction element. More...
#include <APIdefs_Elements.h>
 Public Attributes
API_Elem_Head  | head
General element header.
short  | pen
For internal use.
API_CWJunctionCategoryID  | category
Category of the junction. See API_CWJunctionCategoryID.
API_Guid  | owner
Owner Curtain Wall.
API_Guid  | symbolID
Object identifier. (junctions are always GDL based)
bool  | hasSymbol
In normal case it is always true.
bool  | flipped
True, if the frame is flipped.
UInt32  | clampFramesNum
Number of clamping frames.
UInt32  | clampFrameOrientsNum
In normal case it is equal to clampFramesNum.
UInt32  | clampPanelsNum
Number of clamping panels.
Int32  | libInd
Library Part index if the junction is GDL-based.
Detailed Description
Represents a curtain wall junction element.
Remarks
The Curtain Wall is a hierarchical (system) element consisting of Frame, Panel, Accessory and Junction components: these are the Members of the Curtain Wall, arranged on a Base Surface according to a pre-defined scheme. API_GridElemID is a typedef for UInt64.
Member Data Documentation
◆ category
 API_CWJunctionType::category
Category of the junction. See API_CWJunctionCategoryID.
◆ clampFrameOrientsNum
 API_CWJunctionType::clampFrameOrientsNum
In normal case it is equal to clampFramesNum.
◆ clampFramesNum
 API_CWJunctionType::clampFramesNum
Number of clamping frames.
◆ clampPanelsNum
 API_CWJunctionType::clampPanelsNum
Number of clamping panels.
◆ flipped
 API_CWJunctionType::flipped
True, if the frame is flipped.
◆ hasSymbol
 API_CWJunctionType::hasSymbol
In normal case it is always true.
◆ head
 API_CWJunctionType::head
General element header.
◆ libInd
 API_CWJunctionType::libInd
Library Part index if the junction is GDL-based.
◆ owner
 API_CWJunctionType::owner
Owner Curtain Wall.
◆ pen
 API_CWJunctionType::pen
For internal use.
◆ symbolID
 API_CWJunctionType::symbolID
Object identifier. (junctions are always GDL based)